footie-addies/app/controllers/clubs_controller.rb

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_club
      @club = Club.find(params[:id])